---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.AnalyticalPowerSourceData
source: html/22f4abde-fd1f-0d7f-d38a-cba889efe852.htm
---
# AnalyticalPowerSourceData Members

Specifies whether the .NET object represents a valid Revit entity.